programming/python/django.org
#+setupfile: ../../styles/readtheorg.setup
#+title: Django

* 组成
** App

Project
- a project is a collection of configuration and apps for a particular website
- a project can contain multiple apps

App
- an app is a Web application that does something
- an app can be in multiple projects, can be packaged and distributed for reuse

配置
#+begin_src python
# <site>/<site>/settings.py

INSTALLED_APPS = [
    'django.contrib.admin',
    'django.contrib.auth',
    'django.contrib.contenttypes',
    'django.contrib.sessions',
    'django.contrib.messages',
    'django.contrib.staticfiles',
    '<app>.apps.<App>Config',
]
#+end_src

** 目录结构

#+begin_src sh
# django-admin startproject <site>
<site>/             # 容器，可以任意命名
    manage.py       # 操作 Django 项目的命令行工具
    <site>/         # 项目的 Python 包，用于加载，eg. import <site>.urls
        __init__.py # 标记 Python 包的空文件
        settings.py # 设置
        urls.py     # URL 声明
        wsgi.py     # WSGI (Web Server Gateway Interface) web server 入口

# python manage.py startapp <app>
<site>/
    manage.py
    <app>/
        __init__.py
        admin.py
        apps.py
        migrations/
            __init__.py
        models.py
        tests.py
        views.py
    <site>/
        ...
#+end_src

* Route
** 示例

为 =http://127.0.0.1:8000/<app>/= 设置路由

#+begin_src python
# <site>/<site>/urls.py

from django.conf.urls import include, url
from django.contrib import admin

urlpatterns = [ # 按顺序将 URL 匹配列表中的正则
    url(r'^<app>/', include('<app>.urls')), # include() 引用 URL 配置
                                            # 去除正则匹配的部分，剩余（<app>/ 之后的）传递给 include()
    url(r'^admin/', admin.site.urls),       # admin.site.urls 不需要 include()
]
#+end_src

#+begin_src python
# <site>/<app>/urls.py

from django.conf.urls import url
from . import views

urlpatterns = [
    url(r'^$', views.index, name='index'),
]
#+end_src

* Model
** 方法

| =__str__()= | 输出为字符串 |
|-------------+--------------|
|             |              |

** 示例

定义
#+begin_src python
# <site>/<app>/models.py

from django.db import models

class <Model_1>(models.Model): # 继承 django.db.models.Model
    <name_1> = models.CharField(max_length=<n>) # 长度将用于数据表 schema 和数据验证
    <name_2> = models.DateTimeField('<comment>')

class <Model_2>(models.Model):
    <name_1> = models.ForeignKey(<Model_1>, on_delete=models.CASCADE)
    <name_2> = models.IntegerField(default=<n>)
#+end_src

配置
#+begin_src python
# <site>/<site>/settings.py

INSTALLED_APPS = [
    ...
    '<app>.apps.<App>Config',
]
#+end_src

生成数据表
#+begin_src sh
python manage.py makemigrations <app>
python manage.py migrate
#+end_src

使用
#+begin_src python
# 列出所有记录
<Model>.objects.all()

# 新增记录
obj = <Model>(<name_1>=..., <name_2>=...)
obj.save()

# 读取属性值
obj.<name_1>

# 修改属性值
obj.<name_2> = ...
obj.save()
#+end_src

* View
** 示例

#+begin_src python
# <site>/<app>/views.py

from django.http import HttpResponse

def index(request):
    return HttpResponse("Hello, world.")
#+end_src

* 数据库
