programming/python/django.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Django</title>
<!-- 2016-05-10 Tue 16:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">Django</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 组成</a>
<ul>
<li><a href="#sec-1-1">1.1. App</a></li>
<li><a href="#sec-1-2">1.2. 目录结构</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Route</a>
<ul>
<li><a href="#sec-2-1">2.1. 示例</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Model</a>
<ul>
<li><a href="#sec-3-1">3.1. 方法</a></li>
<li><a href="#sec-3-2">3.2. 示例</a></li>
</ul>
</li>
<li><a href="#sec-4">4. View</a>
<ul>
<li><a href="#sec-4-1">4.1. 示例</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 数据库</a>
<ul>
<li><a href="#sec-5-1">5.1. 配置</a></li>
<li><a href="#sec-5-2">5.2. 命令行</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Admin</a>
<ul>
<li><a href="#sec-6-1">6.1. 示例</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Django 库</a>
<ul>
<li><a href="#sec-7-1">7.1. <code>django.conf</code></a>
<ul>
<li><a href="#sec-7-1-1">7.1.1. <code>django.conf.urls</code></a></li>
</ul>
</li>
<li><a href="#sec-7-2">7.2. <code>django.db</code></a>
<ul>
<li><a href="#sec-7-2-1">7.2.1. <code>django.db.models</code></a></li>
<li><a href="#sec-7-2-2">7.2.2. <code>django.db.models.Model</code></a></li>
<li><a href="#sec-7-2-3">7.2.3. <code>django.db.models.Manager</code></a></li>
<li><a href="#sec-7-2-4">7.2.4. <code>django.db.models.query.QuerySet</code></a></li>
</ul>
</li>
<li><a href="#sec-7-3">7.3. <code>django.utils</code></a>
<ul>
<li><a href="#sec-7-3-1">7.3.1. <code>django.utils.timezone</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-8">8. 命令行</a>
<ul>
<li><a href="#sec-8-1">8.1. <code>django-admin</code></a></li>
<li><a href="#sec-8-2">8.2. <code>manage.py</code></a></li>
</ul>
</li>
<li><a href="#sec-9">9. 安装</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 组成</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> App</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Project
</p>
<ul class="org-ul">
<li>a project is a collection of configuration and apps for a particular website
</li>
<li>a project can contain multiple apps
</li>
</ul>

<p>
App
</p>
<ul class="org-ul">
<li>an app is a Web application that does something
</li>
<li>an app can be in multiple projects, can be packaged and distributed for reuse
</li>
</ul>

<p>
配置
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">&lt;site&gt;/&lt;site&gt;/settings.py</span>

<span style="color: #FD971F;">INSTALLED_APPS</span> = [
    <span style="color: #E6DB74;">'django.contrib.admin'</span>,
    <span style="color: #E6DB74;">'django.contrib.auth'</span>,
    <span style="color: #E6DB74;">'django.contrib.contenttypes'</span>,
    <span style="color: #E6DB74;">'django.contrib.sessions'</span>,
    <span style="color: #E6DB74;">'django.contrib.messages'</span>,
    <span style="color: #E6DB74;">'django.contrib.staticfiles'</span>,
    <span style="color: #E6DB74;">'&lt;app&gt;.apps.&lt;App&gt;Config'</span>,
]
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 目录结构</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #75715E;"># </span><span style="color: #75715E;">django-admin startproject &lt;site&gt;</span>
&lt;site&gt;/             <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23481;&#22120;&#65292;&#21487;&#20197;&#20219;&#24847;&#21629;&#21517;</span>
    manage.py       <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25805;&#20316; Django &#39033;&#30446;&#30340;&#21629;&#20196;&#34892;&#24037;&#20855;</span>
    &lt;site&gt;/         <span style="color: #75715E;"># </span><span style="color: #75715E;">&#39033;&#30446;&#30340; Python &#21253;&#65292;&#29992;&#20110;&#21152;&#36733;&#65292;eg. import &lt;site&gt;.urls</span>
        __init__.py <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26631;&#35760; Python &#21253;&#30340;&#31354;&#25991;&#20214;</span>
        settings.py <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35774;&#32622;</span>
        urls.py     <span style="color: #75715E;"># </span><span style="color: #75715E;">URL &#22768;&#26126;</span>
        wsgi.py     <span style="color: #75715E;"># </span><span style="color: #75715E;">WSGI (Web Server Gateway Interface) web server &#20837;&#21475;</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">python manage.py startapp &lt;app&gt;</span>
&lt;site&gt;/
    manage.py
    &lt;app&gt;/
        __init__.py
        admin.py
        apps.py
        migrations/
            __init__.py
        models.py
        tests.py
        views.py
    &lt;site&gt;/
        ...
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Route</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 示例</h3>
<div class="outline-text-3" id="text-2-1">
<p>
为 <code>http://127.0.0.1:8000/&lt;app&gt;/</code> 设置路由
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">&lt;site&gt;/&lt;site&gt;/urls.py</span>

<span style="color: #F92672;">from</span> django.conf.urls <span style="color: #F92672;">import</span> include, url
<span style="color: #F92672;">from</span> django.contrib <span style="color: #F92672;">import</span> admin

<span style="color: #FD971F;">urlpatterns</span> = [ <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25353;&#39034;&#24207;&#23558; URL &#21305;&#37197;&#21015;&#34920;&#20013;&#30340;&#27491;&#21017;</span>
    url(r<span style="color: #E6DB74;">'^&lt;app&gt;/'</span>, include(<span style="color: #E6DB74;">'&lt;app&gt;.urls'</span>)), <span style="color: #75715E;"># </span><span style="color: #75715E;">include() &#24341;&#29992; URL &#37197;&#32622;</span>
                                            <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21435;&#38500;&#27491;&#21017;&#21305;&#37197;&#30340;&#37096;&#20998;&#65292;&#21097;&#20313;&#65288;&lt;app&gt;/ &#20043;&#21518;&#30340;&#65289;&#20256;&#36882;&#32473; include()</span>
    url(r<span style="color: #E6DB74;">'^admin/'</span>, admin.site.urls),       <span style="color: #75715E;"># </span><span style="color: #75715E;">admin.site.urls &#19981;&#38656;&#35201; include()</span>
]
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">&lt;site&gt;/&lt;app&gt;/urls.py</span>

<span style="color: #F92672;">from</span> django.conf.urls <span style="color: #F92672;">import</span> url
<span style="color: #F92672;">from</span> . <span style="color: #F92672;">import</span> views

<span style="color: #FD971F;">urlpatterns</span> = [
    url(r<span style="color: #E6DB74;">'^$'</span>, views.index, name=<span style="color: #E6DB74;">'index'</span>),
]
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Model</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 方法</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>__str__()</code></th>
<th scope="col" class="left">输出为字符串</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 示例</h3>
<div class="outline-text-3" id="text-3-2">
<p>
定义
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">&lt;site&gt;/&lt;app&gt;/models.py</span>

<span style="color: #F92672;">from</span> django.db <span style="color: #F92672;">import</span> models

<span style="color: #F92672;">class</span> &lt;Model_1&gt;(models.Model): <span style="color: #75715E;"># </span><span style="color: #75715E;">&#32487;&#25215; django.db.models.Model</span>
    &lt;name_1&gt; = models.CharField(max_length=&lt;n&gt;) <span style="color: #75715E;"># </span><span style="color: #75715E;">&#38271;&#24230;&#23558;&#29992;&#20110;&#25968;&#25454;&#34920; schema &#21644;&#25968;&#25454;&#39564;&#35777;</span>
    &lt;name_2&gt; = models.DateTimeField(<span style="color: #E6DB74;">'&lt;comment&gt;'</span>)

<span style="color: #F92672;">class</span> &lt;Model_2&gt;(models.Model):
    &lt;name_1&gt; = models.ForeignKey(&lt;Model_1&gt;, on_delete=models.CASCADE)
    &lt;name_2&gt; = models.IntegerField(default=&lt;n&gt;)
</pre>
</div>

<p>
配置
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">&lt;site&gt;/&lt;site&gt;/settings.py</span>

<span style="color: #FD971F;">INSTALLED_APPS</span> = [
    ...
    <span style="color: #E6DB74;">'&lt;app&gt;.apps.&lt;App&gt;Config'</span>,
]
</pre>
</div>

<p>
生成数据表
</p>
<div class="org-src-container">

<pre class="src src-sh">python manage.py makemigrations &lt;app&gt;
python manage.py migrate
</pre>
</div>

<p>
使用
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">&#21015;&#20986;&#25152;&#26377;&#35760;&#24405;</span>
&lt;Model&gt;.objects.<span style="color: #F92672;">all</span>()

<span style="color: #75715E;"># </span><span style="color: #75715E;">&#26032;&#22686;&#35760;&#24405;</span>
<span style="color: #FD971F;">obj</span> = &lt;Model&gt;(&lt;name_1&gt;=..., &lt;name_2&gt;=...)
obj.save()

<span style="color: #75715E;"># </span><span style="color: #75715E;">&#35835;&#21462;&#23646;&#24615;&#20540;</span>
obj.&lt;name_1&gt;

<span style="color: #75715E;"># </span><span style="color: #75715E;">&#20462;&#25913;&#23646;&#24615;&#20540;</span>
obj.&lt;name_2&gt; = ...
obj.save()
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> View</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 示例</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">&lt;site&gt;/&lt;app&gt;/views.py</span>

<span style="color: #F92672;">from</span> django.http <span style="color: #F92672;">import</span> HttpResponse

<span style="color: #F92672;">def</span> <span style="color: #A6E22E;">index</span>(request):
    <span style="color: #F92672;">return</span> HttpResponse(<span style="color: #E6DB74;">"Hello, world."</span>)
</pre>
</div>
</div>
</div>
</div>
