programming/python/django.org
** 配置
#+begin_src python
# <site>/<site>/settings.py

DATABASES = {
    'default': {
        'ENGINE': 'django.db.backends.sqlite3',       # django.db.backends.sqlite3
                                                      # django.db.backends.postgresql
                                                      # django.db.backends.mysql
                                                      # django.db.backends.oracle
        'NAME': os.path.join(BASE_DIR, 'db.sqlite3'), # 数据库名
                                                      # 使用 SQLite 时为一个绝对路径
        'HOST':
        'USER':
        'PASSWORD':
    }
}
#+end_src

** 命令行

安装 SQLite3
#+begin_src sh
sudo apt-get install sqlite3
#+end_src

运行
#+begin_src sh
# <site>/
python manage.py dbshell
#+end_src

* Admin
** 示例

#+begin_src python
# <site>/<app>/admin.py

from django.contrib import admin
from .models import <Model>

admin.site.register(<Model>)
#+end_src

* Django 库
** =django.conf=
*** =django.conf.urls=

#+begin_src python
def url(
    regex
,   view        # 调用的 view 函数，第一个参数为 HttpRequest 对象
,   kwargs=None # keyword arguments
,   name=None   # 用于引用此 URL 的唯一名称，如在模板中
,   prefix=''
)
#+end_src

** =django.db=
*** =django.db.models=

| =BooleanField()=  |   |
|-------------------+---|
| =CharField()=     |   |
|-------------------+---|
| =DateField()=     |   |
|-------------------+---|
| =DateTimeField()= |   |
|-------------------+---|
| =DecimalField()=  |   |
|-------------------+---|
| =EmailField()=    |   |
|-------------------+---|
| =FileField()=     |   |
|-------------------+---|
| =FloatField()=    |   |
|-------------------+---|
| =IntegerField()=  |   |
|-------------------+---|
| =TextField()=     |   |
|-------------------+---|
| =TimeField()=     |   |

*** =django.db.models.Model=

#+begin_src python
def save(
    self
,   force_insert=False
,   force_update=False
,   using=None
,   update_fields=None
)
#+end_src

*** =django.db.models.Manager=

Manager
- Django adds a Manager with the name =objects= to every model class by default
- to use a name other than =objects=, rename it on a per-model basis
  + define a class attribute of type =models.Manager()= on that model: =<manager> = models.Manager()=
  + then use =<Model>.<manager>.all()= instead of =<Model>.objects.all()=

返回 =QuerySet= 的方法
| =all()=      | Returns a =QuerySet= of all the objects in the database                  |
|--------------+--------------------------------------------------------------------------|
| =exclude()=  | Returns a =QuerySet= of objects NOT matching the given lookup parameters |
|--------------+--------------------------------------------------------------------------|
| =filter()=   | Returns a =QuerySet= of objects matching the given lookup parameters     |
|--------------+--------------------------------------------------------------------------|
| =order_by()= |                                                                          |
|--------------+--------------------------------------------------------------------------|
| =distinct()= |                                                                          |

不返回 =QuerySet= 的方法
| =get()=    | Returns one object matching the given lookup parameters                   |
|            | - will raise =DoesNotExist= exception if no results                       |
|            | - will raise =MultipleObjectsReturned= exception if more than one results |
|------------+---------------------------------------------------------------------------|
| =count()=  |                                                                           |
|------------+---------------------------------------------------------------------------|
| =exists()= |                                                                           |
|------------+---------------------------------------------------------------------------|
| =first()=  |                                                                           |
|------------+---------------------------------------------------------------------------|
| =last()=   |                                                                           | 

| =create()= |   |
|------------+---|
| =delete()= |   |
|------------+---|
| =update()= |   |

