programming/python/django.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 数据库</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 配置</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">&lt;site&gt;/&lt;site&gt;/settings.py</span>

<span style="color: #FD971F;">DATABASES</span> = {
    <span style="color: #E6DB74;">'default'</span>: {
        <span style="color: #E6DB74;">'ENGINE'</span>: <span style="color: #E6DB74;">'django.db.backends.sqlite3'</span>,       <span style="color: #75715E;"># </span><span style="color: #75715E;">django.db.backends.sqlite3</span>
                                                      <span style="color: #75715E;"># </span><span style="color: #75715E;">django.db.backends.postgresql</span>
                                                      <span style="color: #75715E;"># </span><span style="color: #75715E;">django.db.backends.mysql</span>
                                                      <span style="color: #75715E;"># </span><span style="color: #75715E;">django.db.backends.oracle</span>
        <span style="color: #E6DB74;">'NAME'</span>: os.path.join(BASE_DIR, <span style="color: #E6DB74;">'db.sqlite3'</span>), <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25968;&#25454;&#24211;&#21517;</span>
                                                      <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20351;&#29992; SQLite &#26102;&#20026;&#19968;&#20010;&#32477;&#23545;&#36335;&#24452;</span>
        <span style="color: #E6DB74;">'HOST'</span>:
        <span style="color: #E6DB74;">'USER'</span>:
        <span style="color: #E6DB74;">'PASSWORD'</span>:
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 命令行</h3>
<div class="outline-text-3" id="text-5-2">
<p>
安装 SQLite3
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install sqlite3
</pre>
</div>

<p>
运行
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #75715E;"># </span><span style="color: #75715E;">&lt;site&gt;/</span>
python manage.py dbshell
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Admin</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 示例</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">&lt;site&gt;/&lt;app&gt;/admin.py</span>

<span style="color: #F92672;">from</span> django.contrib <span style="color: #F92672;">import</span> admin
<span style="color: #F92672;">from</span> .models <span style="color: #F92672;">import</span> &lt;Model&gt;

admin.site.register(&lt;Model&gt;)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Django 库</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> <code>django.conf</code></h3>
<div class="outline-text-3" id="text-7-1">
</div><div id="outline-container-sec-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> <code>django.conf.urls</code></h4>
<div class="outline-text-4" id="text-7-1-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #F92672;">def</span> <span style="color: #A6E22E;">url</span>(
    regex
,   view        <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35843;&#29992;&#30340; view &#20989;&#25968;&#65292;&#31532;&#19968;&#20010;&#21442;&#25968;&#20026; HttpRequest &#23545;&#35937;</span>
,   kwargs=<span style="color: #AE81FF;">None</span> <span style="color: #75715E;"># </span><span style="color: #75715E;">keyword arguments</span>
,   name=<span style="color: #AE81FF;">None</span>   <span style="color: #75715E;"># </span><span style="color: #75715E;">&#29992;&#20110;&#24341;&#29992;&#27492; URL &#30340;&#21807;&#19968;&#21517;&#31216;&#65292;&#22914;&#22312;&#27169;&#26495;&#20013;</span>
,   prefix=<span style="color: #E6DB74;">''</span>
)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> <code>django.db</code></h3>
<div class="outline-text-3" id="text-7-2">
</div><div id="outline-container-sec-7-2-1" class="outline-4">
<h4 id="sec-7-2-1"><span class="section-number-4">7.2.1</span> <code>django.db.models</code></h4>
<div class="outline-text-4" id="text-7-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>BooleanField()</code></th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>CharField()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>DateField()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>DateTimeField()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>DecimalField()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>EmailField()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>FileField()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>FloatField()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>IntegerField()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>TextField()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>TimeField()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-7-2-2" class="outline-4">
<h4 id="sec-7-2-2"><span class="section-number-4">7.2.2</span> <code>django.db.models.Model</code></h4>
<div class="outline-text-4" id="text-7-2-2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #F92672;">def</span> <span style="color: #A6E22E;">save</span>(
    <span style="color: #F92672;">self</span>
,   force_insert=<span style="color: #AE81FF;">False</span>
,   force_update=<span style="color: #AE81FF;">False</span>
,   using=<span style="color: #AE81FF;">None</span>
,   update_fields=<span style="color: #AE81FF;">None</span>
)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-2-3" class="outline-4">
<h4 id="sec-7-2-3"><span class="section-number-4">7.2.3</span> <code>django.db.models.Manager</code></h4>
<div class="outline-text-4" id="text-7-2-3">
<p>
Manager
</p>
<ul class="org-ul">
<li>Django adds a Manager with the name <code>objects</code> to every model class by default
</li>
<li>to use a name other than <code>objects</code>, rename it on a per-model basis
<ul class="org-ul">
<li>define a class attribute of type <code>models.Manager()</code> on that model: <code>&lt;manager&gt; = models.Manager()</code>
</li>
<li>then use <code>&lt;Model&gt;.&lt;manager&gt;.all()</code> instead of <code>&lt;Model&gt;.objects.all()</code>
</li>
</ul>
</li>
</ul>

<p>
返回 <code>QuerySet</code> 的方法
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>all()</code></th>
<th scope="col" class="left">Returns a <code>QuerySet</code> of all the objects in the database</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>exclude()</code></td>
<td class="left">Returns a <code>QuerySet</code> of objects NOT matching the given lookup parameters</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>filter()</code></td>
<td class="left">Returns a <code>QuerySet</code> of objects matching the given lookup parameters</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>order_by()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>distinct()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
不返回 <code>QuerySet</code> 的方法
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>get()</code></th>
<th scope="col" class="left">Returns one object matching the given lookup parameters</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">- will raise <code>DoesNotExist</code> exception if no results</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">- will raise <code>MultipleObjectsReturned</code> exception if more than one results</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>count()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>exists()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>first()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>last()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>create()</code></th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>delete()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><code>update()</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
