programming/python/django.org
*** =django.db.models.query.QuerySet=

#+begin_src python
# Creating a QuerySet doesn't involve database activity
q = Entry.objects.filter(headline__startswith="What")
q = q.filter(pub_date__lte=datetime.date.today())
q = q.exclude(body_text__icontains="food")

# Django won't run the query until the QuerySet is evaluated
print(q)
#+end_src

** =django.utils=
*** =django.utils.timezone=

| =now()= |   |
|---------+---|
|         |   |

* 命令行
** =django-admin=

=startproject=
#+begin_src sh
# <site>/../
django-admin startproject <site> # 避免冲突：django，test 等
#+end_src

** =manage.py=

#+begin_src sh
python manage.py <cmd>

<cmd> # 项目
    startapp <app>
    check
    createsuperuser

<cmd> # 运行
    runserver [<ip>:<port>] # IP 默认为 127.0.0.1，设置为 0.0.0.0 监听所有公共 IP
                            # 端口默认为 8000
    shell

<cmd> # 数据库
    dbshell
    makemigrations <app>   # 创建一个 migration
    sqlmigrate <app> <seq> # 读取指定的 migration，返回 SQL
    migrate                # 根据配置中的 INSTALLED_APPS 创建数据库、表
                           # 执行所有未执行的 migration
#+end_src

* 安装

安装（Python 2）
#+begin_src sh
# pip
sudo apt-get install python-pip

# Django
sudo pip install django

# 验证
python -c "import django; print(django.get_version())"
#+end_src

卸载（Python 2）
#+begin_src sh
# Django
sudo pip uninstall django

# pip
sudo apt-get remove python-pip
#+end_src

安装（Python 3）
#+begin_src sh
# Python
sudo apt-get install package
sudo apt-get install python3

# pip
sudo apt-get install python3-pip

# Django
sudo pip3 install django

# 验证
python3 -c "import django; print(django.get_version())"
#+end_src

卸载（Python 3）
#+begin_src sh
# Django
sudo pip3 uninstall django

# pip
sudo apt-get remove python3-pip
#+end_src
