programming/python/django.html
<div id="outline-container-sec-7-2-4" class="outline-4">
<h4 id="sec-7-2-4"><span class="section-number-4">7.2.4</span> <code>django.db.models.query.QuerySet</code></h4>
<div class="outline-text-4" id="text-7-2-4">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">Creating a QuerySet doesn't involve database activity</span>
<span style="color: #FD971F;">q</span> = Entry.objects.<span style="color: #F92672;">filter</span>(headline__startswith=<span style="color: #E6DB74;">"What"</span>)
<span style="color: #FD971F;">q</span> = q.<span style="color: #F92672;">filter</span>(pub_date__lte=datetime.date.today())
<span style="color: #FD971F;">q</span> = q.exclude(body_text__icontains=<span style="color: #E6DB74;">"food"</span>)

<span style="color: #75715E;"># </span><span style="color: #75715E;">Django won't run the query until the QuerySet is evaluated</span>
<span style="color: #F92672;">print</span>(q)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> <code>django.utils</code></h3>
<div class="outline-text-3" id="text-7-3">
</div><div id="outline-container-sec-7-3-1" class="outline-4">
<h4 id="sec-7-3-1"><span class="section-number-4">7.3.1</span> <code>django.utils.timezone</code></h4>
<div class="outline-text-4" id="text-7-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><code>now()</code></th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 命令行</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> <code>django-admin</code></h3>
<div class="outline-text-3" id="text-8-1">
<p>
<code>startproject</code>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #75715E;"># </span><span style="color: #75715E;">&lt;site&gt;/../</span>
django-admin startproject &lt;site&gt; <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36991;&#20813;&#20914;&#31361;&#65306;django&#65292;test &#31561;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> <code>manage.py</code></h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">

<pre class="src src-sh">python manage.py &lt;cmd&gt;

&lt;cmd&gt; <span style="color: #75715E;"># </span><span style="color: #75715E;">&#39033;&#30446;</span>
    startapp &lt;app&gt;
    check
    createsuperuser

&lt;cmd&gt; <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36816;&#34892;</span>
    runserver [&lt;ip&gt;:&lt;port&gt;] <span style="color: #75715E;"># </span><span style="color: #75715E;">IP &#40664;&#35748;&#20026; 127.0.0.1&#65292;&#35774;&#32622;&#20026; 0.0.0.0 &#30417;&#21548;&#25152;&#26377;&#20844;&#20849; IP</span>
                            <span style="color: #75715E;"># </span><span style="color: #75715E;">&#31471;&#21475;&#40664;&#35748;&#20026; 8000</span>
    shell

&lt;cmd&gt; <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25968;&#25454;&#24211;</span>
    dbshell
    makemigrations &lt;app&gt;   <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21019;&#24314;&#19968;&#20010; migration</span>
    sqlmigrate &lt;app&gt; &lt;seq&gt; <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35835;&#21462;&#25351;&#23450;&#30340; migration&#65292;&#36820;&#22238; SQL</span>
    migrate                <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26681;&#25454;&#37197;&#32622;&#20013;&#30340; INSTALLED_APPS &#21019;&#24314;&#25968;&#25454;&#24211;&#12289;&#34920;</span>
                           <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25191;&#34892;&#25152;&#26377;&#26410;&#25191;&#34892;&#30340; migration</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 安装</h2>
<div class="outline-text-2" id="text-9">
<p>
安装（Python 2）
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #75715E;"># </span><span style="color: #75715E;">pip</span>
sudo apt-get install python-pip

<span style="color: #75715E;"># </span><span style="color: #75715E;">Django</span>
sudo pip install django

<span style="color: #75715E;"># </span><span style="color: #75715E;">&#39564;&#35777;</span>
python -c <span style="color: #E6DB74;">"import django; print(django.get_version())"</span>
</pre>
</div>

<p>
卸载（Python 2）
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #75715E;"># </span><span style="color: #75715E;">Django</span>
sudo pip uninstall django

<span style="color: #75715E;"># </span><span style="color: #75715E;">pip</span>
sudo apt-get remove python-pip
</pre>
</div>

<p>
安装（Python 3）
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #75715E;"># </span><span style="color: #75715E;">Python</span>
sudo apt-get install package
sudo apt-get install python3

<span style="color: #75715E;"># </span><span style="color: #75715E;">pip</span>
sudo apt-get install python3-pip

<span style="color: #75715E;"># </span><span style="color: #75715E;">Django</span>
sudo pip3 install django

<span style="color: #75715E;"># </span><span style="color: #75715E;">&#39564;&#35777;</span>
python3 -c <span style="color: #E6DB74;">"import django; print(django.get_version())"</span>
</pre>
</div>

<p>
卸载（Python 3）
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #75715E;"># </span><span style="color: #75715E;">Django</span>
sudo pip3 uninstall django

<span style="color: #75715E;"># </span><span style="color: #75715E;">pip</span>
sudo apt-get remove python3-pip
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-05-10 Tue 16:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
